{
    "name": "Ocean's 8",
    "year": 2018,
    "director": "Gary Ross",
    "writer": [
      "Gary Ross",
      "Olivia Milch"
    ],
    "actors": [
        "Sandra Bullock",
        "Cate Blanchett",
        "Anne Hathaway",
        "Mindy Kaling",
        "Sarah Paulson",
        "Awkwafina",
        "Rihanna",
        "Helena Bonham Carter"
    ],
    "plot": "Newly paroled con artist Debbie Ocean – the 'late' Danny Ocean's younger sister – convinces former partner-in-crime Lou to join her in a new heist. They assemble their team: bankrupt fashion designer Rose Weil, jewelry maker Amita, eager to move out of her mother's house, hacker Nine Ball, street hustler and pickpocket Constance, and profiteer Tammy, who fences stolen goods out of her suburban home. Debbie plans to steal the Toussaint, a $150 million Cartier necklace, during the upcoming Met Gala and use movie star Daphne Kluger as a mule. The team manipulates Daphne into hiring Weil and convince Cartier to loan Daphne the Toussaint. They digitally scan the necklace to manufacture a cubic zirconia counterfeit. Tammy secures a job at Vogue and gains access to the gala, and Debbie leads Daphne to invite art dealer Claude Becker, whose betrayal sent Debbie to prison, as her date. Lou confronts Debbie for planning revenge against Becker, but Debbie reassures her this is not the case. When Rose learns the Toussaint can only be unclasped by a special magnet carried by the bodyguards hired by Cartier, Nine Ball enlists her younger sister Veronica's help in defeating the mechanism. At the gala, Lou spikes Daphne's soup, causing her to vomit in the restroom, a blind spot to the Met's cameras created by Nine Ball. Constance removes the necklace and sneaks it to Amita, who splits it into smaller pieces of jewelry. The Toussaint's disappearance triggers the museum's evacuation, but the search ends when Tammy "finds" the duplicate necklace. Constance slips the Toussaint pieces to the team to smuggle out; Debbie plants a piece on Becker. After the heist, Debbie and Lou reveal Daphne had been in on the plan. Cartier discovers the recovered necklace is a fake and dispatches insurance investigator John Frazier. Having crossed paths with the Oceans before, Frazier immediately suspects Debbie, but her careful presence on the gala's video footage gives her an unbeatable alibi. She tells Frazier she may know who stole the necklace. Daphne visits Becker and sends Frazier a picture of the jewel Debbie planted. To further frame Becker, Debbie hires actresses posing as elderly socialites to sell the Toussaint pieces and deposit the money in Becker's name. Frazier takes Becker into custody. As the eight celebrate their victory, Lou reveals the heist's true target: while the gala was being evacuated, she and "The Amazing" Yen replaced a Met display of royal jewels with replicas, escaping with gems even more valuable than the Toussaint. With a larger-than-expected share of the score, each member of the team goes her separate way: Amita travels to Paris with a man she meets on Tinder, Weil pays off her debts and opens her own store, Constance buys a spacious loft in the city and becomes a YouTuber, Tammy expands her business in stolen goods, Nine Ball opens a pool bar, Daphne becomes a film director, Lou goes on a cross-country road trip, and Debbie visits Danny's grave with a martini in his honor.",
    "future": true,
    "release-date": "2018-6-8",
    "categories": [
      "American Comedy"
    ]
  }